In [2]:
import pandas as pd

In [3]:
data = {
    "EmployeeID": [1,2,3,4,5,6,7,8], 
    "Department": ["HR","Engineering", "Engineering", "HR","Engineering", "Engineering", "HR", "Engineering"], 
    "Age": [35, 30, 32, 40, 28, 27, 45, 29],
    "Salary": [50000, 60000, 65000, 55000, 48000, 47000, 53000, 61000]
}

df= pd.DataFrame(data)
df

   EmployeeID   Department  Age  Salary
0           1           HR   35   50000
1           2  Engineering   30   60000
2           3  Engineering   32   65000
3           4           HR   40   55000
4           5  Engineering   28   48000
5           6  Engineering   27   47000
6           7           HR   45   53000
7           8  Engineering   29   61000

In [5]:
ds = pd.read_csv("D:\Python Study\FDS\Assingment/ass_1_Q_1_data.csv")
ds

   EmployeeID   Department  Age  Salary
0           1           HR   35   50000
1           2  Engineering   30   60000
2           3  Engineering   32   65000
3           4           HR   40   55000
4           5    Marketing   28   48000
5           6    Marketing   27   47000
6           7           HR   45   53000
7           8  Engineering   29   61000